#2) განმარტეთ control flow, ჩამოწერეთ მისი შემადგენელი ტექნიკები, აღწერეთ თითოეული
#ის განსაზღვრავს, თუ რა თანმიმდევრობით შესრულდება კონკრეტული ბრძანებები პროგრამაში.Sequencing (მიმდევრულობა),Selection (არჩევანი),Iteration (ციკლები).




#5) for ციკლის საშვალებით გამოიტანეთ რიცხვები 20-მდე

for number in range (20):
    print(number)

#6) for ციკლის საშვალებით გამოიტანეთ რიცხვები 30-ის ჩათვლით

for number31 in range (31):
    print(number31)
#7) for ციკლის საშვალებით გამოიტანეთ რიცხვები 15-იდან 80-მდე

for number80 in range (15,80):
    print(number80)
#8) for ციკლის საშვალებით გამოიტანეთ რიცხვები 0-იდან 64-ის ჩათვლით
for number64 in range (65):
    print(number64)



