# შექმენით სია სადაც ჩამოწერეთ 4 ბოსტნეულს, შემდეგ თქვენთვის ყველაზე 2 არასასურველი ამ სიიდან ჩაანცვლეთ ახალი ელემენტებით

vegetables = ["ბადრიჯანი", "კარტოფილი", "ხახვი", "ტომატი"]


print("first list")
print(vegetables)


vegetables[2] = "წიწაკა"  
vegetables[3] = "კიტრი"   

print("new list")
print(vegetables)

#მომხმარებელს შემოატანინეთ რიცხვი 0-იდან 4-მდე და შეინახეთ ის "user_choice"-ის ცვლადში, შემდეგ ბოსტნეულსი სიიდან დაუბეჭდეთ ის ელემენტი რომელიც მომხმარებელმა აირჩია, ესეიგი იმ user_choice ინდექსზე მყოფი ელემენტი სიაში

vegetables = ["ბადრიჯანი", "კარტოფილი", "ხახვი", "ტომატი"]

# მომხმარებლისგან რიცხვის შეყვანა
user_choice = int(input("შეიყვანეთ რიცხვი 0-დან 4-მდე: "))

# შეამოწმეთ, რომ რიცხვი შესაბამისია
if 0 <= user_choice <= 4:
    # დაბეჭდეთ ელემენტი სიიდან
    print(f"აირჩიეთ ბოსტნეული: {vegetables[user_choice]}")
else:
    print("მიუწვდომელი ინდექსი, გთხოვთ შეიყვანეთ რიცხვი 0-დან 4-მდე.")

#ახსენით რას ნიშნავს რომ list და string არის დალაგებული მიმდევრობები, კომენტარებით დაწერეთ მათ თვისებებს შორის განსხვავებები. მოიყვანეთ მაგალითები
#List: გამოყენებულია დალაგებული მონაცემების შენახვისთვის, რომელიც შეიძლება შეიცავდეს სხვადასხვა ტიპის მონაცემებს და რომლის ელემენტებიც შეიძლება შეიცვალოს.
#String: გამოიყენება მხოლოდ ტექსტის შენახვისთვის და მას არ შეუძლია შეიცვალოს თავისი ელემენტები.
#დალაგებული მიმდევრობა ნიშნავს იმას, რომ ორივე ტიპი (List და String) ინახავს მონაცემებს გარკვეული თანმიმდევრობით, სადაც თითოეული ელემენტი შეიძლება წაიკითხოს მისი ინდექსის მიხედვით.

#ახსენით რა არის slicing
#არის ფუნქცია, რომელიც საშუალებას აძლევს Python-ში მოიპოვოთ ელემენტების თანმიმდევრობა,გარკვეული დიაპაზონის მიხედვით. ეს მეთოდი ნიშნავს, რომ თქვენ შეგიძლიათ აირჩიოთ მხოლოდ ნაწილი ჩამონათვალიდან ან სტრინგიდან, მაგალითად, პირველი რამდენიმე ელემენტი ან რომელიმე შუალედური ელემენტები.

# შექმენით სია რომელშიც ჩამოწერეთ რიცხვებს 1-იდან 20-ის ჩათვლით. slicing-ის საშვალებით გამოიტანეთ რიხცები 5-იდან 10-მდე

numbers = list(range(1, 21))

selected_numbers = numbers[4:10]  
print(selected_numbers)

#შექმენით სია ციური სხეულებზე სიტყვებით და შემდეგ გამოიტანეთ მხოლოდ ის ელემენტები, რომლებიც ლუწ ინდექსებზე დგანან

celestial_bodies = ["მზის სისტემა", "მთვარე", "მარსი", "ვენერა", "იუპიტერი", "სატურნი", "პლუტონი"]

for index, body in enumerate(celestial_bodies):
    if index % 2 == 0:
        print(body)
        

#შექმენით სია 0-დან 15-მდე რიცხვებით. გამოიტანეთ მხოლოდ ის რიცხვები, რომლებიც კენტ ინდექსებზე დგანან

numbers = list(range(16))
odds = numbers[1::2]

print(odds)

#9) შექმენით string რომელშიც შეინახავთ თქვენს სახელსა და გვარს, შემდეგ ცალ ცალკე გამოიტანეთ ამ სტრინგიდან ჯერ სახელი და შემდეგ გვარი slicing-ის საშვალებით

full_name = "Nita Kadeishvili"


first_name = full_name[0:4]


last_name = full_name[5:]

print("სახელი:", first_name)
print("გვარი:", last_name)








