#შევქმენი my_balance ცვლადი რომელიც არის 7
my_balance= 7 
#ეს ცვლადი გაიზარდა 2_ით
my_balance= my_balance + 2
#შემდეგ 3_ით
my_balance += 3
#და შემდეგ გაიყო 2ზე
my_balance/=2


print(my_balance)
#საუკეთესო პრაქტიკა არის ჰეშთეგების გამოყენება (#) ის გვეხმარება რომ უფრო ადვილად გავიგოთ რა ხდება ამა და ამ ცვლადში.


#2) გააკეთეთ პროგრამა რომელშიც გექნებათ ცვლდი სადაც შეინახავთ თქვენს hobby-ის, ასევე შექმენით string ტიპის ცვლადი რომელშიც შეინახვათ თქვენთვის სასურველ მესიჯს, შემდეგ ეს ორი ტექსტი დაბეჭდეთ ერთად, ასევე აიღეთ 2 integer ტიპის ცვლადი და დაბეჭდეთ მათი შეკრებაც, თქვენი სიტყვებით ახსენით რა განსხვავებაა ამ ორი სხვადასხვა ტიპის ცვლადების დამატების ოპერაციებს შორის, რა ეწოდება თითოეულ მოვლენას

#ცვლადი ჩემი ჰობი
my_hobby= "learning languages" 
#გამოვიტანე ჩემ ჰობთან ერთად მესიჯი
print( my_hobby + "is my favorite thing to do")

#დავწერე ციფრების ცვლადი 
num1=8
#მივუმატე მნიშვნელობა რომ ციფრი2 არის 2ით ნაკლები ციფრ1ზე
num2= num1 - 2
#მივუმატე ერთმანეთს ორივე ცვლადი
print(num1 + num2)

#
