#1.შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.


your_age=input("How old are you? ")
print(type(your_age))


# თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს 

Name="Nita" #string type ტექსტური ცვლადი
Last_name="Kadeishvili" #string type ტექსტური ცვლადი
Residence="Tbilisi,Georgia"#string type ტექსტური ცვლადი
Age=15 #integer მთელი რიცხვი
Height=1.70 #float ნაშთიანი გაყოფით მიღებული არამთელი რიცხვი

#აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი

Lesson="French"
Starts=4
Ends=5.30

print(type(Lesson))
print(type(Starts))
print(type(Ends))

#მომხმარებელს შემოატანინეთ თავისი ასაკი, შემდეგ შემოატანინეთ წლების რაოდენობა. მიღებული ინფორმაცია შეინახეთ ცვლადებში და გამოითვალეთ, რამდენი წლის იქნება მომხმარებელი y (მომხმარებლის მიერ შემოტანილი) წლის შემდეგ. საბოლოოდ გამოუტანეთ შედეგი შემდეგი სახით: "[წლები] წლის შემდეგ თქვენ იქნებით [მომავალი ასაკი] წლის". დავალების შესასრულებლად გამოიყენეთ მონაცემთა ტიპების ხელოვნურად შეცვლის მეთოდები: int() - რომ შეასრულოთ ართიმეტიკული მოქმედებები, str() - რომ დაბეჭდოთ შედეგი შეცდომების გარეშე

Age=input("How old are you? ")
Age=int(Age)
Years=input("Enter years amount: ")
Years=int(Years)
In_future=Age + Years
print(str(Years) +" "+  "years later you'll be" + " " + str(In_future) + " " + "years old")
